package com.example.esfahan;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.view.View;
import android.widget.ListView;

public class HistoricalMonumentsActivity extends AppCompatActivity {

    View back;
    ListView list;

    String[] name = {
            "پل شهرستان", "مدرسه چهار", "مهمانسرای عباسی", "انگورستان ملک", "بازار قیصریه", "میدان امام"
    };

    String[] des = {
            "پل شهرستان یا پل جی یا پل جسر حسین قدیمی ترین پل اصفهان روی رودخانهٔ زاینده رود است. این پل در زمان ساسانیان ایجاد گردید و در زمان دیلمیان و سلجوقیان تعمیر و مرمت شده است.",
            "یکی از زیباترین آثار تاریخی اصفهان مدرسه چهارباغ یا مدرسه سلطانی یا مدرسه مادرشاه، در ضلع شرقی خیابان چهارباغ بنای باشکوه و نفیسی است که می توان آن را آخرین بنای مهم و با عظمتی دانست که در عصر صفویان در اصفهان ساخته شد.",
            "مهمانسرای عباسی با پشتوانه ۳۲۰ ساله هنوز به عنوان قدیمی ترین هتل دنیا به جهانیان معرفی نشده است. گرچه هنوز قدیمی ترین هتل جهان به عنوان میراث جهانی به ثبت یونسکو نرسیده و تنها پشتوانه اش ثبت ملی آن در سال ۴۰ است، اما آیا این باور که مهمانسرای عباسی اصفهان با ۳۲۰ سال قدمت تاریخی می تواند به این عنوان نایل شود، در بین دست اندرکاران آن وجود دارد.",
            "یکی ازقدیمی ترین آثار تاریخی اصفهان انگورستان ملاک است. این باغ انگور در زمان حکومت نادر شاه افشار به عنوان مالیات از مردم گرفته شد و در دوره ناصرالدین شاه قاجار به تملک مسئول امور مالی حکومت اصفهان، یعنی پدر حاج محمد ابراهیم ملک التّجار درآمد. بعدها حاج ابراهیم خان بنای انگورستان را به منظور برگزاری مراسم عزاداری و تعزیه احداث کرد.",
            " بازار قیصریه بازاری است در بافت تاریخی اصفهان که عمدتاً به فعالیت فرش فروشان اختصاص دارد. سردر قیصریه، ورودی این بازار است. این بازار که با نام بازار سلطانی نیز خوانده می شود، از بزرگترین و مجلل ترین آثار تاریخی اصفهان و مرکز خرید و فروش در دوران صفویه بوده است و در سال ۱۰۲۹ هجری قمری (دوران صفویه) در شمال میدان تاریخی امام ایجاد گردید که میدان امام را به میدان عتیق (کهنه) و اصفهان عصر سلجوقی مربوط می کند.",
            "میدان امام  دومین میدان بزرگ دنیا مجموعه بزرگی از ساختمان های مسجد امام، مسجد شیخ لطف الله و عالی قاپو وبازار سنتی اصفهان  می باشد که از آثاردوره صفوی به معماری علامه شیخ بهایی در شهر اصفهان مجموعه ای از دو مسچد بسیار زیبای امام و مسجد شیخ لطف الله مجموعه حکومتی عالی قاپو ومیدان ورزش وتمرین نظامی بوده که به مجموعه بازا ر متصل بوده و در عین حال دور میدان فروشگاههای ساخت و فروش صنایع دستی می باشدودر کشور ایران است."
    };

    Integer[] image = {
            R.drawable.historical_monuments1,
            R.drawable.historical_monuments2,
            R.drawable.historical_monuments3,
            R.drawable.historical_monuments4,
            R.drawable.historical_monuments5,
            R.drawable.historical_monuments6,
    };

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_historical_monuments);

        back = findViewById(R.id.back);
        list = findViewById(R.id.list);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                finish();
            }
        });

        ListAdapter adapter = new ListAdapter(this, name, des, image);
        list.setAdapter(adapter);

    }
}